app/views/properties/index0.xml.erb

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
xmlns:xsd="http://www.w3.org/2001/XMLSchema"
xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
<soap:Body>
<ImportRM_Login
xmlns="http://tempuri.org/YSI.Interfaces.WebServices/ItfRevenueManagement">
<UserName>upmrev</UserName>
<Password>upmrev</Password>
<ServerName>VNSQL3TEST_2K12
</ServerName>
<Database>eoaraozyb_test</Database>
<Platform>SQL Server</Platform>
<InterfaceEntity>UPM Rev Mgt</InterfaceEntity>
<InterfaceLicense>MIIBEAYJKwYBBAGCN1gDoIIBATCB/gYKKwYBBAGCN1gDAaCB7zCB7AIDAgABAgJo
AQICAIAEAAQQZSazZ/eSXhFXRnOf/nuu5wSByJlcNc5hMT3FbusX+lcfVCJv6Mhh
XhJh3eYBr2Gkd4Q6EgBxeLppuF73I/bmHKYlCsqKi/kPMKzkx21FyjvBzHZQTMlV
WvoNbs+x9FfGGmnbOcm+PFeC5qAnYOag1uA4LaFjIlqTcgP6x7CefOQiRzXinlqv
W3hxMmVis6Mt/STxz8/RYyGWkfuE12sIF7YCPZRZ6JQCg80cMXUYMWi29vujz/W4
myJvVW0fOMx8TfEvEXNxwADOQTyhXimebgxWplrhho4lsYru</InterfaceLicense>
<XmlDoc>
  <community xmlns="" ID="017" POSTDATE="20170403" COMPANY="United Property Management">
<units>
<unit ID="Royalton on the Green Apartments" AVAILDATE="20170505" STATUS="On Notice" UNITTYPE="rg-1-1a" UNITCAT="11" AMENITYVALUE="0.00">
<offeredterm LT="12" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,356" CONTYPE="T" CONVALUE="0.00"/>
<offeredterm LT="13" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,356" CONTYPE="T" CONVALUE="0.00"/>
<offeredterm LT="15" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,348" CONTYPE="T" CONVALUE="0.00"/>
<offeredterm LT="17" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,348" CONTYPE="T" CONVALUE="0.00"/>
<offeredterm LT="19" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,348" CONTYPE="T" CONVALUE="0.00"/>
<offeredterm LT="21" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,348" CONTYPE="T" CONVALUE="0.00"/>
<offeredterm LT="22" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,348" CONTYPE="T" CONVALUE="0.00"/>
</unit>
<unit ID="Royalton on the Green Apartments" AVAILDATE="20170417" STATUS="On Notice" UNITTYPE="rg-2-1c" UNITCAT="11" AMENITYVALUE="0.00">
<offeredterm LT="12" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,570" CONTYPE="T" CONVALUE="0.00"/>
<offeredterm LT="13" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,570" CONTYPE="T" CONVALUE="0.00"/>
<offeredterm LT="15" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,562" CONTYPE="T" CONVALUE="0.00"/>
<offeredterm LT="17" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,562" CONTYPE="T" CONVALUE="0.00"/>
<offeredterm LT="19" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,562" CONTYPE="T" CONVALUE="0.00"/>
<offeredterm LT="21" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,562" CONTYPE="T" CONVALUE="0.00"/>
<offeredterm LT="22" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,562" CONTYPE="T" CONVALUE="0.00"/>
</unit>
<unit ID="Royalton on the Green Apartments" AVAILDATE="20170505" STATUS="On Notice" UNITTYPE="rg-2-1c" UNITCAT="11" AMENITYVALUE="0.00">
<offeredterm LT="12" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,595" CONTYPE="T" CONVALUE="0.00"/>
<offeredterm LT="13" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,595" CONTYPE="T" CONVALUE="0.00"/>
<offeredterm LT="15" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,587" CONTYPE="T" CONVALUE="0.00"/>
<offeredterm LT="17" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,587" CONTYPE="T" CONVALUE="0.00"/>
<offeredterm LT="19" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,587" CONTYPE="T" CONVALUE="0.00"/>
<offeredterm LT="21" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,587" CONTYPE="T" CONVALUE="0.00"/>
<offeredterm LT="22" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,587" CONTYPE="T" CONVALUE="0.00"/>
</unit>
<unit ID="Royalton on the Green Apartments" AVAILDATE="20170401" STATUS="On Notice" UNITTYPE="rg-2-2b" UNITCAT="11" AMENITYVALUE="0.00">
<offeredterm LT="12" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,602" CONTYPE="T" CONVALUE="0.00"/>
<offeredterm LT="13" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,602" CONTYPE="T" CONVALUE="0.00"/>
<offeredterm LT="15" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,594" CONTYPE="T" CONVALUE="0.00"/>
<offeredterm LT="17" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,594" CONTYPE="T" CONVALUE="0.00"/>
<offeredterm LT="19" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,594" CONTYPE="T" CONVALUE="0.00"/>
<offeredterm LT="21" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,594" CONTYPE="T" CONVALUE="0.00"/>
<offeredterm LT="22" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,594" CONTYPE="T" CONVALUE="0.00"/>
</unit>
<unit ID="Royalton on the Green Apartments" AVAILDATE="20170605" STATUS="On Notice" UNITTYPE="rg-2-2b" UNITCAT="11" AMENITYVALUE="0.00">
<offeredterm LT="12" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,610" CONTYPE="T" CONVALUE="0.00"/>
<offeredterm LT="13" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,610" CONTYPE="T" CONVALUE="0.00"/>
<offeredterm LT="15" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,602" CONTYPE="T" CONVALUE="0.00"/>
<offeredterm LT="17" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,602" CONTYPE="T" CONVALUE="0.00"/>
<offeredterm LT="19" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,602" CONTYPE="T" CONVALUE="0.00"/>
<offeredterm LT="21" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,602" CONTYPE="T" CONVALUE="0.00"/>
<offeredterm LT="22" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,602" CONTYPE="T" CONVALUE="0.00"/>
</unit>
<unit ID="Royalton on the Green Apartments" AVAILDATE="20170529" STATUS="On Notice" UNITTYPE="rg-2-2d" UNITCAT="11" AMENITYVALUE="0.00">
<offeredterm LT="12" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,656" CONTYPE="T" CONVALUE="0.00"/>
<offeredterm LT="13" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,656" CONTYPE="T" CONVALUE="0.00"/>
<offeredterm LT="15" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,648" CONTYPE="T" CONVALUE="0.00"/>
<offeredterm LT="17" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,648" CONTYPE="T" CONVALUE="0.00"/>
<offeredterm LT="19" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,648" CONTYPE="T" CONVALUE="0.00"/>
<offeredterm LT="21" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,648" CONTYPE="T" CONVALUE="0.00"/>
<offeredterm LT="22" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,648" CONTYPE="T" CONVALUE="0.00"/>
</unit>
<unit ID="Royalton on the Green Apartments" AVAILDATE="20170405" STATUS="On Notice" UNITTYPE="rg-2-2d" UNITCAT="11" AMENITYVALUE="0.00">
<offeredterm LT="12" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,776" CONTYPE="T" CONVALUE="0.00"/>
<offeredterm LT="13" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,776" CONTYPE="T" CONVALUE="0.00"/>
<offeredterm LT="15" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,768" CONTYPE="T" CONVALUE="0.00"/>
<offeredterm LT="17" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,768" CONTYPE="T" CONVALUE="0.00"/>
<offeredterm LT="19" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,768" CONTYPE="T" CONVALUE="0.00"/>
<offeredterm LT="21" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,768" CONTYPE="T" CONVALUE="0.00"/>
<offeredterm LT="22" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,768" CONTYPE="T" CONVALUE="0.00"/>
</unit>
<unit ID="Royalton on the Green Apartments" AVAILDATE="20170505" STATUS="On Notice" UNITTYPE="rg-2-2d" UNITCAT="11" AMENITYVALUE="0.00">
<offeredterm LT="12" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,729" CONTYPE="T" CONVALUE="0.00"/>
<offeredterm LT="13" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,729" CONTYPE="T" CONVALUE="0.00"/>
<offeredterm LT="15" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,721" CONTYPE="T" CONVALUE="0.00"/>
<offeredterm LT="17" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,721" CONTYPE="T" CONVALUE="0.00"/>
<offeredterm LT="19" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,721" CONTYPE="T" CONVALUE="0.00"/>
<offeredterm LT="21" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,721" CONTYPE="T" CONVALUE="0.00"/>
<offeredterm LT="22" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,721" CONTYPE="T" CONVALUE="0.00"/>
</unit>
<unit ID="Royalton on the Green Apartments" AVAILDATE="20170404" STATUS="On Notice" UNITTYPE="rg-2-2d" UNITCAT="11" AMENITYVALUE="0.00">
<offeredterm LT="12" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,648" CONTYPE="T" CONVALUE="0.00"/>
<offeredterm LT="13" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,648" CONTYPE="T" CONVALUE="0.00"/>
<offeredterm LT="15" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,640" CONTYPE="T" CONVALUE="0.00"/>
<offeredterm LT="17" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,640" CONTYPE="T" CONVALUE="0.00"/>
<offeredterm LT="19" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,640" CONTYPE="T" CONVALUE="0.00"/>
<offeredterm LT="21" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,640" CONTYPE="T" CONVALUE="0.00"/>
<offeredterm LT="22" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,640" CONTYPE="T" CONVALUE="0.00"/>
</unit>
<unit ID="Royalton on the Green Apartments" AVAILDATE="20170405" STATUS="On Notice" UNITTYPE="rg-2-2i" UNITCAT="11" AMENITYVALUE="0.00">
<offeredterm LT="12" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,602" CONTYPE="T" CONVALUE="0.00"/>
<offeredterm LT="13" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,602" CONTYPE="T" CONVALUE="0.00"/>
<offeredterm LT="15" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,594" CONTYPE="T" CONVALUE="0.00"/>
<offeredterm LT="17" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,594" CONTYPE="T" CONVALUE="0.00"/>
<offeredterm LT="19" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,594" CONTYPE="T" CONVALUE="0.00"/>
<offeredterm LT="21" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,594" CONTYPE="T" CONVALUE="0.00"/>
<offeredterm LT="22" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="$1,594" CONTYPE="T" CONVALUE="0.00"/>
</unit>
</units>
</community>



</XmlDoc>
</ImportRM_Login>
</soap:Body>
</soap:Envelope>

    <community ID="017" POSTDATE="<%=Date.today.to_s.tr('-','')%>" xmlns="" COMPANY="United Property Management">
      <% x = "Royalton on the Green Apartments" %>
      <units>
      <% Property.available_per_prop(x).each do |property| %>
        <unit ID="<%=x%>" AVAILDATE="<%= property.move_out != nil ? property.move_out.next_day(5).to_s.tr('-','') : DateTime.now.to_s.tr('-','') %>" STATUS="On Notice" UNITTYPE="<%=property.unit_type.unit_type%>" UNITCAT="11" AMENITYVALUE="0.00">
          <% PropertyName.all[Property.building_names.index(x)].lease_terms.split(",").map{ |i| i.to_i}.each do |month| %>
            <% if property.group ==   "Vacant Unrented Not Ready" ||  "Vacant Unrented Ready" %>
              <offeredterm LT="<%=month%>" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="<%= number_to_currency @bed_premiums_per_building[x].calculate_rent0(((property.unit_rent * ( 1.0 + ((property.move_out.year * 12.0 + property.move_out.month ) - (property.unit_type.market_rate_date.year * 12.0 + property.unit_type.market_rate_date.month)) / 12.0 * property.unit_type.growth_rate)) - property.unit_type.amount_off - ( property.unit_rent * property.unit_type.percentage_off) ).to_i, property.unit_type.bedroom.to_i, month), precision: 0 %>" CONTYPE="T" CONVALUE="0.00"/>
            <% elsif property.group == "Notice Unrented"  %>
              <% if property.move_out.next_day(5).strftime("%Y%m") <= DateTime.now.strftime("%Y%m") %>
                <offeredterm LT="<%=month%>" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="<%= number_to_currency @bed_premiums_per_building[x].calculate_rent0(((property.unit_rent * ( 1.0 + ((property.move_out.year * 12.0 + property.move_out.month ) - (property.unit_type.market_rate_date.year * 12.0 + property.unit_type.market_rate_date.month)) / 12.0 * property.unit_type.growth_rate)) - property.unit_type.amount_off - ( property.unit_rent * property.unit_type.percentage_off) ).to_i, property.unit_type.bedroom.to_i, month), precision: 0 %>" CONTYPE="T" CONVALUE="0.00"/>
              <% elsif property.move_out.next_day(5).strftime("%Y%m") == DateTime.now.next_month(1).strftime("%Y%m") %>
                <offeredterm LT="<%=month%>" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="<%= number_to_currency @bed_premiums_per_building[x].calculate_rent1(((property.unit_rent * ( 1.0 + ((property.move_out.year * 12.0 + property.move_out.month ) - (property.unit_type.market_rate_date.year * 12.0 + property.unit_type.market_rate_date.month)) / 12.0 * property.unit_type.growth_rate)) - property.unit_type.amount_off - ( property.unit_rent * property.unit_type.percentage_off) ).to_i, property.unit_type.bedroom.to_i, month), precision: 0 %>" CONTYPE="T" CONVALUE="0.00"/>
              <% elsif property.move_out.next_day(5).strftime("%Y%m") == DateTime.now.next_month(2).strftime("%Y%m") %>
                <offeredterm LT="<%=month%>" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="<%= number_to_currency @bed_premiums_per_building[x].calculate_rent2(((property.unit_rent * ( 1.0 + ((property.move_out.year * 12.0 + property.move_out.month ) - (property.unit_type.market_rate_date.year * 12.0 + property.unit_type.market_rate_date.month)) / 12.0 * property.unit_type.growth_rate)) - property.unit_type.amount_off - ( property.unit_rent * property.unit_type.percentage_off) ).to_i, property.unit_type.bedroom.to_i, month), precision: 0 %>" CONTYPE="T" CONVALUE="0.00"/>
              <% elsif property.move_out.next_day(5).strftime("%Y%m") == DateTime.now.next_month(3).strftime("%Y%m") %>
                <offeredterm LT="<%=month%>" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="<%= number_to_currency @bed_premiums_per_building[x].calculate_rent3(((property.unit_rent * ( 1.0 + ((property.move_out.year * 12.0 + property.move_out.month ) - (property.unit_type.market_rate_date.year * 12.0 + property.unit_type.market_rate_date.month)) / 12.0 * property.unit_type.growth_rate)) - property.unit_type.amount_off - ( property.unit_rent * property.unit_type.percentage_off) ).to_i, property.unit_type.bedroom.to_i, month), precision: 0 %>" CONTYPE="T" CONVALUE="0.00"/>
              <% elsif property.move_out.next_day(5).strftime("%Y%m") == DateTime.now.next_month(4).strftime("%Y%m") %>
                <offeredterm LT="<%=month%>" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="<%= number_to_currency @bed_premiums_per_building[x].calculate_rent4(((property.unit_rent * ( 1.0 + ((property.move_out.year * 12.0 + property.move_out.month ) - (property.unit_type.market_rate_date.year * 12.0 + property.unit_type.market_rate_date.month)) / 12.0 * property.unit_type.growth_rate)) - property.unit_type.amount_off - ( property.unit_rent * property.unit_type.percentage_off) ).to_i, property.unit_type.bedroom.to_i, month), precision: 0 %>" CONTYPE="T" CONVALUE="0.00"/>
              <% elsif property.move_out.next_day(5).strftime("%Y%m") == DateTime.now.next_month(5).strftime("%Y%m") %>
                <offeredterm LT="<%=month%>" BASERENT="0.00" TOTALCONCESSION="0.00" EFFECTIVERENT="<%= number_to_currency @bed_premiums_per_building[x].calculate_rent5(((property.unit_rent * ( 1.0 + ((property.move_out.year * 12.0 + property.move_out.month ) - (property.unit_type.market_rate_date.year * 12.0 + property.unit_type.market_rate_date.month)) / 12.0 * property.unit_type.growth_rate)) - property.unit_type.amount_off - ( property.unit_rent * property.unit_type.percentage_off) ).to_i, property.unit_type.bedroom.to_i, month), precision: 0 %>" CONTYPE="T" CONVALUE="0.00"/>
              <%end%>
            <%end%>
          <%end%>
        </unit>
      <%end%>
      </units>
    </community>
